In [1]:
import numpy as np
import pandas as pd

In [2]:
# Seriesクラスの生成
# 1次元のデータ構造をもつクラス
# 1次元 = データが縦に並んでいるだけ
series = pd.Series(data=[1, 2, 3, 4, 5], index=['A', 'B', 'C', 'D', 'E'])
series

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [3]:
# numpyの配列やリストを指定
array = np.arange(1, 11)
index = 'a b c d e f g h i j'.split()

series = pd.Series(data=array, index=index)
series

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [4]:
# データの選択
# 辞書型データのように直接インデックスを指定してデータを抽出
# 但し、多くの場合locメソッドやilocメソッドを使う
series = pd.Series(data=[1, 2, 3, 4, 5], index=['A', 'B', 'C', 'D', 'E'])
series

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [5]:
series['A']

1

In [6]:
series['A':'D']

A    1
B    2
C    3
D    4
dtype: int64

In [7]:
# locメソッド
series.loc['A']

1

In [8]:
series.loc['A':'D']

A    1
B    2
C    3
D    4
dtype: int64

In [9]:
# 特定のデータだけ抽出したい時
# タプル型にしてindexを指定
series.loc[['B', 'D']]

B    2
D    4
dtype: int64

In [10]:
# ilocメソッド
# データの形を番号に変えて指定
series.iloc[1]

2

In [11]:
series.iloc[:2]

A    1
B    2
dtype: int64

In [12]:
# DataFrameクラスの生成
# 縦×横の2次元のデータクラス
df = pd.DataFrame(data=[[1, 2, 3], [4, 5, 6], [7, 8, 9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]], index=['A', 'B', 'C'], columns=['C1', 'C2', 'C3'])
df

   C1  C2  C3
A   1   2   3
B   4   5   6
C   7   8   9

In [14]:
# head()メソッドで上の5行だけを抽出
# irisはデータ分析のサンプル用のデータ
from sklearn.datasets import load_iris

iris = load_iris()
iris_df = pd.DataFrame(data=iris.data, columns=iris.feature_names)
iris_df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [15]:
# nrowsで何行読むか指定
df = pd.read_csv('../python/scp_ing_pra/chap4/最高気温.csv', nrows=500)
df.head()

      時点  地域コード   地域  最高気温（日最高気温の月平均の最高値）【℃】  注記
0  2009年  13000  東京都                    30.1 NaN
1  2010年  13000  東京都                    33.5 NaN
2  2011年  13000  東京都                    31.2 NaN
3  2012年  13000  東京都                    33.1 NaN
4  2013年  13000  東京都                    33.2 NaN

In [16]:
# データの大まかな内容を確認
df.shape

(10, 5)

In [17]:
# 結構使う
df.describe()

         地域コード  最高気温（日最高気温の月平均の最高値）【℃】   注記
count     10.0               10.000000  0.0
mean   13000.0               31.890000  NaN
std        0.0                1.183638  NaN
min    13000.0               30.100000  NaN
25%    13000.0               31.200000  NaN
50%    13000.0               31.700000  NaN
75%    13000.0               33.000000  NaN
max    13000.0               33.500000  NaN

In [18]:
# データ数と型を確認
# non-null = 欠損していないデータ数を表す
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   時点                      10 non-null     object
 1   地域コード                   10 non-null     int64
 2   地域                      10 non-null     object
 3   最高気温（日最高気温の月平均の最高値）【℃】  10 non-null     float64
 4   注記                      0 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 528.0+ bytes

In [19]:
# ユニークな値の数を確認
df.nunique()

時点                        10
地域コード                      1
地域                         1
最高気温（日最高気温の月平均の最高値）【℃】     9
注記                         0
dtype: int64

In [20]:
# 欠損値の数を確認
df.isnull().sum()

時点                         0
地域コード                      0
地域                         0
最高気温（日最高気温の月平均の最高値）【℃】     0
注記                        10
dtype: int64

In [21]:
# 行名と列名を確認
df.index

RangeIndex(start=0, stop=10, step=1)

In [22]:
df.columns

Index(['時点', '地域コード', '地域', '最高気温（日最高気温の月平均の最高値）【℃】', '注記'], dtype='object')

In [23]:
# データの選択と抽出
# DataFrameクラスの中から狙ったデータを取り出すことスキルは分析の精度を高めるために極めて重要
np.random.seed(10)

df = pd.DataFrame(data=np.random.randn(5, 5), index=['A', 'B', 'C', 'D', 'E'], columns=['C1', 'C2', 'C3', 'C4', 'C5'])

df

         C1        C2        C3        C4        C5
A  1.331587  0.715279 -1.545400 -0.008384  0.621336
B -0.720086  0.265512  0.108549  0.004291 -0.174600
C  0.433026  1.203037 -0.965066  1.028274  0.228630
D  0.445138 -1.136602  0.135137  1.484537 -1.079805
E -1.977728 -1.743372  0.266070  2.384967  1.123691

In [24]:
df.loc['A']

C1    1.331587
C2    0.715279
C3   -1.545400
C4   -0.008384
C5    0.621336
Name: A, dtype: float64

In [25]:
# 行は全部で特定の列だけを取り出したい
df.loc[:, 'C1']

A    1.331587
B   -0.720086
C    0.433026
D    0.445138
E   -1.977728
Name: C1, dtype: float64

In [26]:
# A行のC1列、C3列だけをピンポイントで取り出したい
# 複数の列を取り出すときは[]でタプル型とすることに注意
df.loc['A',['C1', 'C3'] ]

C1    1.331587
C3   -1.545400
Name: A, dtype: float64

In [27]:
# 条件による選択
df > 0

      C1     C2     C3     C4     C5
A   True   True  False  False   True
B  False   True   True   True  False
C   True   True  False   True   True
D   True  False   True   True  False
E  False  False   True   True   True

In [28]:
# Trueのところだけ値を残す
df[df > 0]

         C1        C2        C3        C4        C5
A  1.331587  0.715279       NaN       NaN  0.621336
B       NaN  0.265512  0.108549  0.004291       NaN
C  0.433026  1.203037       NaN  1.028274  0.228630
D  0.445138       NaN  0.135137  1.484537       NaN
E       NaN       NaN  0.266070  2.384967  1.123691

In [29]:
df['C1'] > 0

A     True
B    False
C     True
D     True
E    False
Name: C1, dtype: bool

In [30]:
# 身長が170cmを超えている人(C1のTrue)だけのデータを抜き出したい時とかに便利
df[df['C1'] > 0]

         C1        C2        C3        C4        C5
A  1.331587  0.715279 -1.545400 -0.008384  0.621336
C  0.433026  1.203037 -0.965066  1.028274  0.228630
D  0.445138 -1.136602  0.135137  1.484537 -1.079805

In [31]:
df[(df['C1'] > 0) & (df['C1'] < 1)]

         C1        C2        C3        C4        C5
C  0.433026  1.203037 -0.965066  1.028274  0.228630
D  0.445138 -1.136602  0.135137  1.484537 -1.079805

In [32]:
# データの追加
# Seriesクラスは四則演算が可能
df['new_column'] = df['C1'] * df['C2']
df

         C1        C2        C3        C4        C5  new_column
A  1.331587  0.715279 -1.545400 -0.008384  0.621336    0.952456
B -0.720086  0.265512  0.108549  0.004291 -0.174600   -0.191191
C  0.433026  1.203037 -0.965066  1.028274  0.228630    0.520947
D  0.445138 -1.136602  0.135137  1.484537 -1.079805   -0.505944
E -1.977728 -1.743372  0.266070  2.384967  1.123691    3.447917

In [33]:
# データの削除
df.drop(columns=['C1'])

         C2        C3        C4        C5  new_column
A  0.715279 -1.545400 -0.008384  0.621336    0.952456
B  0.265512  0.108549  0.004291 -0.174600   -0.191191
C  1.203037 -0.965066  1.028274  0.228630    0.520947
D -1.136602  0.135137  1.484537 -1.079805   -0.505944
E -1.743372  0.266070  2.384967  1.123691    3.447917

In [34]:
df # 更新されていない

         C1        C2        C3        C4        C5  new_column
A  1.331587  0.715279 -1.545400 -0.008384  0.621336    0.952456
B -0.720086  0.265512  0.108549  0.004291 -0.174600   -0.191191
C  0.433026  1.203037 -0.965066  1.028274  0.228630    0.520947
D  0.445138 -1.136602  0.135137  1.484537 -1.079805   -0.505944
E -1.977728 -1.743372  0.266070  2.384967  1.123691    3.447917

In [35]:
df.drop(index=['A'], inplace=True)

In [36]:
df # 更新されている

         C1        C2        C3        C4        C5  new_column
B -0.720086  0.265512  0.108549  0.004291 -0.174600   -0.191191
C  0.433026  1.203037 -0.965066  1.028274  0.228630    0.520947
D  0.445138 -1.136602  0.135137  1.484537 -1.079805   -0.505944
E -1.977728 -1.743372  0.266070  2.384967  1.123691    3.447917

In [37]:
# 欠損値を埋める
df = pd.DataFrame(data=[[1, 2, 3, np.nan, 4],
                       [5, np.nan, 6, np.nan, 7],
                       [8, 9, 10, np.nan, 11],
                       [12, np.nan, np.nan, np.nan, 13],
                       [14, 15, 16, 17, 18]],
                 index=['A', 'B', 'C', 'D', 'E'],
                 columns=['C1', 'C2', 'C3', 'C4', 'C5'])
df

   C1    C2    C3    C4  C5
A   1   2.0   3.0   NaN   4
B   5   NaN   6.0   NaN   7
C   8   9.0  10.0   NaN  11
D  12   NaN   NaN   NaN  13
E  14  15.0  16.0  17.0  18

In [38]:
# dropna:欠損しているデータを削除
df.dropna() # 行で見て欠損値がないデータだけを残す

   C1    C2    C3    C4  C5
E  14  15.0  16.0  17.0  18

In [39]:
df['C2'].dropna()

A     2.0
C     9.0
E    15.0
Name: C2, dtype: float64

In [40]:
# 欠損値があるかないかを返すメソッド
df['C2'].isnull()

A    False
B     True
C    False
D     True
E    False
Name: C2, dtype: bool

In [41]:
# 特定の列について欠損値がある部分を削除(上記のTrueの部分)
# 「一番重要なデータは身長だから身長のデータに欠損があるものは使わない！」みたいなときに便利
df[df['C2'].isnull() == False]

   C1    C2    C3    C4  C5
A   1   2.0   3.0   NaN   4
C   8   9.0  10.0   NaN  11
E  14  15.0  16.0  17.0  18

In [42]:
# 同じ行で3つ欠損していたら消す
df.dropna(thresh=3)

   C1    C2    C3    C4  C5
A   1   2.0   3.0   NaN   4
B   5   NaN   6.0   NaN   7
C   8   9.0  10.0   NaN  11
E  14  15.0  16.0  17.0  18

In [43]:
# 列に含まれる欠損値数で削除するデータを指定したいとき axis
df.dropna(thresh=3, axis=1)

   C1    C2    C3  C5
A   1   2.0   3.0   4
B   5   NaN   6.0   7
C   8   9.0  10.0  11
D  12   NaN   NaN  13
E  14  15.0  16.0  18

In [45]:
# 欠損値を別の値で置換 fillna
# C2の欠損値を平均値で埋めたい
df['C2'].fillna(df['C2'].mean())

A     2.000000
B     8.666667
C     9.000000
D     8.666667
E    15.000000
Name: C2, dtype: float64

In [46]:
# C2だけでなく全体の欠損値に当てはめる
df.fillna(df.mean())

   C1         C2     C3    C4  C5
A   1   2.000000   3.00  17.0   4
B   5   8.666667   6.00  17.0   7
C   8   9.000000  10.00  17.0  11
D  12   8.666667   8.75  17.0  13
E  14  15.000000  16.00  17.0  18

In [47]:
# カテゴリカルなデータの操作

# 辞書型のDataFrameの書き方
df = pd.DataFrame({'C1' : ['A', 'A', 'A', 'B', 'B', 'C', np.nan],
                  'C2' : [20, 50, 60, 80, 100, 30, 50],
                  'C3' : [40, 200, 100, 500, 40, 200, 40]})
df

    C1   C2   C3
0    A   20   40
1    A   50  200
2    A   60  100
3    B   80  500
4    B  100   40
5    C   30  200
6  NaN   50   40

In [48]:
# カテゴリとデータの数を確認
df['C1'].value_counts()

A    3
B    2
C    1
Name: C1, dtype: int64

In [49]:
# カテゴリC1がAのデータだけ取り出す
df[df['C1'] == 'A']

  C1  C2   C3
0  A  20   40
1  A  50  200
2  A  60  100

In [51]:
# カテゴリ変数の欠損値を埋める
# mode: 最頻値
df['C1'].fillna(df['C1'].mode()[0])

0    A
1    A
2    A
3    B
4    B
5    C
6    A
Name: C1, dtype: object

In [52]:
df # 更新されていない

    C1   C2   C3
0    A   20   40
1    A   50  200
2    A   60  100
3    B   80  500
4    B  100   40
5    C   30  200
6  NaN   50   40

In [55]:
# 更新
df['C1'] = df['C1'].fillna(df['C1'].mode()[0])
df['C1']

0    A
1    A
2    A
3    B
4    B
5    C
6    A
Name: C1, dtype: object

In [61]:
# カテゴリの割合を計算する
# round関数で桁数を丸める
round(df['C1'].value_counts() / len(df), 2)

A    0.57
B    0.29
C    0.14
Name: C1, dtype: float64

In [63]:
# グループ化して各種統計量を計算する
df.groupby('C1')

In [64]:
# 会社A,B,Cに所属している人の合計
df.groupby('C1').sum()

     C2   C3
C1
A   180  380
B   180  540
C    30  200

In [65]:
df.groupby('C1').mean()

    C2   C3
C1
A   45   95
B   90  270
C   30  200

In [66]:
df.groupby('C1').max()

     C2   C3
C1
A    60  200
B   100  500
C    30  200

In [75]:
df_1 = pd.DataFrame(data=np.random.randn(5, 5), index=['A', 'B', 'C', 'D', 'E'], columns=['C1', 'C2', 'C3', 'C4', 'C5'])
df_2 = pd.DataFrame(data=np.random.randn(5, 5), index=['F', 'G', 'H', 'I', 'J'], columns=['C1', 'C2', 'C3', 'C4', 'C5'])

df_1

         C1        C2        C3        C4        C5
A -0.260859  0.548428  0.603199  1.006861 -0.294426
B -1.420881 -0.678947  0.533885  0.743974  2.225050
C  0.117181  0.244615 -0.177299 -0.405730  0.781775
D  0.353478 -0.207279 -1.079697 -0.123070 -0.390982
E  1.255174  0.947126 -1.022311  1.167168 -0.571977

In [76]:
df_2

         C1        C2        C3        C4        C5
F  0.133137  1.202744 -1.024753  0.160399 -1.130475
G -1.941300  0.986598  0.028227 -0.822368 -1.586552
H -0.401473  1.342179  0.402469 -0.372761 -0.672023
I  0.105812 -1.547305  1.344807  0.503189  1.194351
J -0.563506  0.854829  0.687905 -1.533069  0.148961

In [77]:
# df_1, df_2のデータテーブルを結合
pd.concat([df_1, df_2])

         C1        C2        C3        C4        C5
A -0.260859  0.548428  0.603199  1.006861 -0.294426
B -1.420881 -0.678947  0.533885  0.743974  2.225050
C  0.117181  0.244615 -0.177299 -0.405730  0.781775
D  0.353478 -0.207279 -1.079697 -0.123070 -0.390982
E  1.255174  0.947126 -1.022311  1.167168 -0.571977
F  0.133137  1.202744 -1.024753  0.160399 -1.130475
G -1.941300  0.986598  0.028227 -0.822368 -1.586552
H -0.401473  1.342179  0.402469 -0.372761 -0.672023
I  0.105812 -1.547305  1.344807  0.503189  1.194351
J -0.563506  0.854829  0.687905 -1.533069  0.148961

In [78]:
# 横方向に結合したいとき
pd.concat([df_1, df_2], axis=1, sort=True)

,C1,C2,C3,C4,C5,C1,C2,C3,C4,C5
A,-0.260859,0.548428,0.603199,1.006861,-0.294426,NaN,NaN,NaN,NaN,NaN
B,-1.420881,-0.678947,0.533885,0.743974,2.225050,NaN,NaN,NaN,NaN,NaN
C,0.117181,0.244615,-0.177299,-0.405730,0.781775,NaN,NaN,NaN,NaN,NaN
D,0.353478,-0.207279,-1.079697,-0.123070,-0.390982,NaN,NaN,NaN,NaN,NaN
E,1.255174,0.947126,-1.022311,1.167168,-0.571977,NaN,NaN,NaN,NaN,NaN
F,NaN,NaN,NaN,NaN,NaN,0.133137,1.202744,-1.024753,0.160399,-1.130475
G,NaN,NaN,NaN,NaN,NaN,-1.941300,0.986598,0.028227,-0.822368,-1.586552
H,NaN,NaN,NaN,NaN,NaN,-0.401473,1.342179,0.402469,-0.372761,-0.672023
I,NaN,NaN,NaN,NaN,NaN,0.105812,-1.547305,1.344807,0.503189,1.194351
J,NaN,NaN,NaN,NaN,NaN,-0.563506,0.854829,0.687905,-1.533069,0.148961

In [79]:
# 関数の適用
# 特定のデータに関数を適用するときはapplyメソッドを使うと便利
df = pd.DataFrame(data=np.random.randn(5, 5), index=['A', 'B', 'C', 'D', 'E'], columns=['C1', 'C2', 'C3', 'C4', 'C5'])
df

         C1        C2        C3        C4        C5
A  0.315111 -0.574918 -0.360171  0.436185 -0.037918
B -1.004716  0.591453  0.227817  0.249179  0.095763
C  0.449022 -0.286002 -0.862758 -0.741825  1.105575
D -2.017719  0.540541 -1.442299 -1.608850 -1.006569
E -0.257534  0.730507 -1.698401  1.674076  1.163724

In [80]:
def square(x):
    return x ** 2

In [82]:
df['C1'].apply(square) # squareが複数の引数を取るときは使いにくい

A    0.099295
B    1.009455
C    0.201621
D    4.071189
E    0.066324
Name: C1, dtype: float64

In [83]:
# 複数の引数を取るとき
# 方法1: 呼び出し時に特定のデータを指定する
def add(x, y):
    return x + y

In [84]:
add(df['C1'], df['C2'])

A   -0.259806
B   -0.413263
C    0.163020
D   -1.477178
E    0.472974
dtype: float64

In [85]:
# 方法2: dfを引数に取る
def add(df):
    return df['C1'] + df['C2']

In [86]:
df.apply(add, axis=1)

A   -0.259806
B   -0.413263
C    0.163020
D   -1.477178
E    0.472974
dtype: float64

In [87]:
def square_and_cube(x):
    return pd.Series([x ** 2, x ** 3])

In [88]:
df[['squared', 'cubed']] = df['C1'].apply(square_and_cube)
df

         C1        C2        C3        C4        C5   squared     cubed
A  0.315111 -0.574918 -0.360171  0.436185 -0.037918  0.099295  0.031289
B -1.004716  0.591453  0.227817  0.249179  0.095763  1.009455 -1.014216
C  0.449022 -0.286002 -0.862758 -0.741825  1.105575  0.201621  0.090532
D -2.017719  0.540541 -1.442299 -1.608850 -1.006569  4.071189 -8.214513
E -0.257534  0.730507 -1.698401  1.674076  1.163724  0.066324 -0.017081